

/*******************************定义字符数组********************************/

unsigned char code dis1[] = {"www.hificat.com"};
unsigned char code dis2[] = {"0571-85956028"};

/*****************************************************************************
函数名称：lcd_bz
函数功能：检测lcd显示是否繁忙
入口参数: 无    
出口参数：result，忙为1，闲为0
*****************************************************************************/

bit lcd_bz(void)
{
	bit result;
	rs = 0;
	rw = 1;
	ep = 1;
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	result = (bit)(P0 & 0x80);
	ep = 0;
	return result;
}

/*****************************************************************************
函数名称：lcd_wcmd
函数功能：lcd写指令
入口参数: cmd    
出口参数：无
*****************************************************************************/

void lcd_wcmd(uchar cmd)
{
	while(lcd_bz());//判断LCD是否忙碌
	rs = 0;
	rw = 0;
	ep = 0;
	_nop_();
	_nop_();
	P0 = cmd;
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	ep = 1;
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	ep = 0;

}

/*****************************************************************************
函数名称：lcd_wdat
函数功能：lcd写数据
入口参数: dat    
出口参数：无
*****************************************************************************/

void lcd_wdat(uchar dat)
{
	while(lcd_bz());//判断LCD是否忙碌
	rs = 1;
	rw = 0;
	ep = 0;
	P0 = dat;
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	ep = 1;
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	ep = 0;

}

/*****************************************************************************
函数名称：lcd_disp_char
函数功能：lcd显示一个字符
入口参数: x，y，dat   
出口参数：无
*****************************************************************************/

void lcd_disp_char(uchar x,uchar y,uchar dat)	   // y为1时候是第一行，否则为第二行

{
	uchar address ;
	if(y==1)
	{
		address=0x80+x ;  //显示在第一排的时候x的地址
	}
	else
	{
		address=0xc0+x ;   //显示在第二排的时候x的地址
	}

	lcd_wcmd(address);
	lcd_wdat(dat);

}

/*****************************************************************************
函数名称：lcd_disp_str
函数功能：lcd显示一个字符串
入口参数: column，line，*str   
出口参数：无
*****************************************************************************/

void LCD_disp_str(uchar column,uchar line,uchar *str)
{
	uchar n=0;

	while(*str!='\0')
	{
		lcd_disp_char(column++,line,*str++);
	}

}

/*****************************************************************************
函数名称：lcd_init
函数功能：lcd初始化
入口参数: 无    
出口参数：无
*****************************************************************************/

void lcd_init(void)
{
	lcd_wcmd(0x38);
	delay(1);
	lcd_wcmd(0x0c);
	delay(1);
	lcd_wcmd(0x06);
	delay(1);
	lcd_wcmd(0x01);
	delay(1);

}