
/*******************************定义字符数组********************************/

code uchar ATE0[]="ATE0\r\n";			   //程序初始化AT部分首先关闭回显
code uchar CREG_CMD[]="AT+CREG?\r\n";	   //查询网络注册情况
code uchar SMS_send[]="AT+CMGS=18\r\n";	   //八位位组代码数目
code uchar ATCN[]="AT+CNMI=2,1\r\n";	   //短信存入SIM卡
code uchar CMGF[]="AT+CMGF=0\r\n";		   //消息格式为PDU,中文短信
code uchar CMGR[12]="AT+CMGR=1\r\n";	   //读取第一条消息
code uchar CMGD[12]="AT+CMGD=1\r\n";	   //删除第一条消息

/*****************************************************************************
1.如果你的晶振是11.0592M
只需要修改下面的号码就可以了,给成你手上拿着的手机的号码


修改方法   在下面这段字符中找到 5129021411F5 
 
 其实5129021411F5 --> 15922041115
18622044083 8126924480F3


 看明白了吗  电话是两位两位颠倒 将您手上的手机号码替换即可
*****************************************************************************/
uchar  code Sms2_Pdu[]="0891683108200205F011000B818126924480F30008A704521B601D";

/*****************************************************************************
函数名称：AT
函数功能：初始化TC35模块
入口参数: 无    
出口参数：无
*****************************************************************************/

void AT(void)
{
	
	clearBuff();
    Print_Str(ATE0);
    delay(50);

	while(strstr(aa,"OK")==NULL)
    {
        delay(50);
        led(0x01);
        clearBuff();
        Print_Str(ATE0);
    }
	led(0x02);

        Print_Str(ATCN);
        delay(50);

        Print_Str(CMGF);
        delay(100);

	while(1)
    {
        clearBuff();
        Print_Str(CREG_CMD);
        delay(50);
        if(((aa[9]=='0')&&(aa[11]=='1'))||((aa[9]=='0')&&(aa[11]=='5')))
        {
            clearBuff();
            led(0x08);
            break;
        }
        else
        {
            clearBuff();
            led(0x04);
            delay(50);
        }
	}
}
